namespace MerlinBot_Service.Stuff;

public static class Messages
{
    public static readonly string[] RusnyaMessages = {
        "Сосати, русня тупа!",
        "Використання даної команди зменшує популяцію русні на планеті",
        "Пиздити ногами, якщо в паспорті пише русскій!!1",
        "Якщо ти русскій, то пішов ти нахуй, дружок..."
    };

    public static readonly string[] CtrlPhotos = {
        "https://imgur.com/qhSOvWj",
        "https://imgur.com/b0ReKV9",
        "https://imgur.com/fI42Ode",
        "https://imgur.com/Dy1tPdX"
    };

    public static readonly string[] CtrlGameMessages = {
        "\nНехай почнеться міні-срач!",
        "\nНе забудьте після гри йобнути трохи русні командою <i><b>/huyak</b></i>",
        "\n"
    };

    public static readonly string[] CheersMessages = {
        "ЗА ЦЮ ГРУПУ!",
        "За цю групу так за цю групу... \nДО ДНА",
        "🥂🥂🥂🥂🥂🥂"
    };

    public static readonly string[] UkraineMessages = {
        "Смерть ворогам!",
        "Вірю в Збройні Сили України!",
        "З нами правда і Бог!",
        "Ворог не пройде! Ми на своїй землі!",
        "Москаляку на гіляку!",
        "Ти українець, а значить, вже переміг!",
        "Ми спокійні, бо ми на своїй землі, в себе вдома!",
        "Рашці пизда, ми над цим працюємо..."
    };

    public static readonly string[] BydloGame1Messages = {
        "Ви пробудили древнє зло...",
        "І варто воно було того?",
        "Подумай потім над своєю поведінкою..."
    };

    public static readonly string[] BydloGame2Messages = {
        "Поспіхом переглядаю архівні документи чату",
        "Цікаво...",
        "Перевіряю дані...",
        "Шаманимо, чаклуємо...",
        "Дзвоню логістам домовитись за доставку библа"
    };

    public static readonly string[] BydloGame3Messages = {
        "Хто б міг подумати, але библо дня сьогодні ",
        "Піймався! Вітаю, сьогодні ти библо дня, ",
        "Систему хакнули! Судячи з інформації, библо дня - ",
        "І найбільш чудова людина сьогодні... а ні, помилочка, це лише библо - ",
        "Ну ти і библо, ",
        "Здається, ти библо дня, "
    };
    
    public static readonly string[] LeftMessages = {
        ", прощавай! Було приємно провести з тобою час 👋"
    };
}